{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 512, 256, 1], "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_1", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_1", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_2", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_2", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_3", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_3", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_4", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_4", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_5", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_5", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_6", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_6", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_7", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_7", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_8", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_8", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_4", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_9", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 1024}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_9", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_10", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 1024}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_10", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_10", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "up_sampling2d_1", "size": [2, 2], "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["activation_8", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_11", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_11", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_11", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_12", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512}}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_12", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_12", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_13", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 512}}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_13", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_13", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "up_sampling2d_2", "size": [2, 2], "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_2", "inbound_nodes": [[["activation_6", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_14", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_14", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256}}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_14", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_14", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_15", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256}}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_15", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_15", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_16", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 256}}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_16", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_16", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "up_sampling2d_3", "size": [2, 2], "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_3", "inbound_nodes": [[["activation_4", 0, 0, {}], ["up_sampling2d_3", 0, 0, {}]]], "config": {"name": "concatenate_3", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_17", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_17", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128}}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_17", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_17", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_18", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128}}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_18", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_18", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_19", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_19", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 128}}, {"class_name": "BatchNormalization", "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_19", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_19", "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_4", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "up_sampling2d_4", "size": [2, 2], "trainable": true}}, {"class_name": "Concatenate", "name": "concatenate_4", "inbound_nodes": [[["activation_2", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]], "config": {"name": "concatenate_4", "axis": 3, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_20", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_20", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64}}, {"class_name": "BatchNormalization", "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_20", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_20", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_21", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_21", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64}}, {"class_name": "BatchNormalization", "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_21", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_21", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"padding": "same", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "conv2d_22", "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 64}}, {"class_name": "BatchNormalization", "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"beta_regularizer": null, "name": "batch_normalization_22", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"activation": "relu", "name": "activation_22", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_23", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"padding": "valid", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "name": "conv2d_23", "kernel_size": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "filters": 1}}], "name": "model_1", "output_layers": [["conv2d_23", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6"}